{
    "artigos": [
        {"titulo": "Quer desenvolver um software de sucesso? Foque no que é essencial",
         "tags": "ti,mercado,arquitetura",
         "imagem": "https://blog.izap.com.br/wp-content/uploads/2022/05/como-desenvolver-um-software-de-sucesso.jpg",
         "conteudo": "Embora existam várias definições sobre o que é arquitetura de software, podemos afirmar que está ligada a um ponto do sistema complexo de modificar e que é avaliada a longo prazo, na maioria das vezes. É neste momento que definimos o objetivo principal do software e analisamos as consequências dessas escolhas. <strong>A arquitetura alinha o objetivo e a visão do software a curto, médio e longo prazos, sendo crucial para o sucesso de uma solução.</strong> Da mesma forma, quando a arquitetura é negligenciada o time de engenharia fica mais exposto ao acaso e às complexidades desnecessárias. Porém, assim como tudo no universo de desenvolvimento de software, também há várias opções de arquiteturas"},
        
        {"titulo": "Gestão e planejamento de projetos de software com SCRUM",
         "tags": "ti,mercado,scrum",
         "imagem": "https://artia.com/wp-content/uploads/2015/08/Descubra-o-que-%C3%A9-Scrum-e-como-ele-se-aplica-%C3%A0-gest%C3%A3o-de-projetos.jpg",
         "conteudo": "Atualmente, Planejamento  e Gestão Estratégica são áreas com grande potencial para pesquisas e aplicações práticas em organizações privadas e públicas. Conceitos de gerenciamento vem crescendo bastante e chamando a atenção dos mais variados tipos de profissionais, que visam, por meio de técnicas, métodos e melhoria de processos, alcançar os objetivos de suas organizações. </br></br>Profissionais da área de Tecnologia da Informação (TI) se utilizam de padrões e metodologias no gerenciamento e planejamento dos seus respectivos projetos. Equipes menores e com tempo reduzido para desenvolver um produto optam por metodologias ágeis em meio ao planejamento como forma de gerir o projeto, e, dentre as metodologias existentes, o Scrum é uma das mais difundidas em Engenharia de Software. O objetivo do artigo é apresentar a metodologia ágil Scrum indicando as possíveis vantagens na adoção desta metodologia nos projetos de TI. A ideia é trazer ao leitor conceitos básicos do gerenciamento de projetos conduzidos por SCRUM, evidenciando relações diretas entre planejamento, gestão estratégica e projetos de TI."},

        {"titulo": "ChatGPT: o que a qualidade de software pode aprender com a inteligência artificial?",
         "tags": "ti,mercado,esg",
         "imagem": "https://www.remessaonline.com.br/blog/wp-content/uploads/2023/01/ChatGPT.jpg.optimal.jpg",
         "conteudo": "A cada nova revolução tecnológica que surge no mundo, a mesma pergunta volta à tona: <strong>o homem será substituído pela máquina? </strong>Desde o temor com a invenção do computador aos dias de hoje, o medo de perder nossos empregos permeia as discussões sobre as tecnologias que prometem virar do avesso as relações de trabalho. A maior novidade desse debate é a tão falada inteligência artificial (IA), cuja face mais polêmica vem sendo mostrada desde os últimos meses de 2022 e atende pelo nome de ChatGPT."},

         {"titulo": "Gestão e planejamento de projetos de software com SCRUM",
         "tags": "ti,mercado,scrum",
         "imagem": "https://artia.com/wp-content/uploads/2015/08/Descubra-o-que-%C3%A9-Scrum-e-como-ele-se-aplica-%C3%A0-gest%C3%A3o-de-projetos.jpg",
         "conteudo": "Atualmente, Planejamento  e Gestão Estratégica são áreas com grande potencial para pesquisas e aplicações práticas em organizações privadas e públicas. Conceitos de gerenciamento vem crescendo bastante e chamando a atenção dos mais variados tipos de profissionais, que visam, por meio de técnicas, métodos e melhoria de processos, alcançar os objetivos de suas organizações. </br></br>Profissionais da área de Tecnologia da Informação (TI) se utilizam de padrões e metodologias no gerenciamento e planejamento dos seus respectivos projetos. Equipes menores e com tempo reduzido para desenvolver um produto optam por metodologias ágeis em meio ao planejamento como forma de gerir o projeto, e, dentre as metodologias existentes, o Scrum é uma das mais difundidas em Engenharia de Software. O objetivo do artigo é apresentar a metodologia ágil Scrum indicando as possíveis vantagens na adoção desta metodologia nos projetos de TI. A ideia é trazer ao leitor conceitos básicos do gerenciamento de projetos conduzidos por SCRUM, evidenciando relações diretas entre planejamento, gestão estratégica e projetos de TI."}
    ]

}